## Data-Engineering Assessment

#### With Python

In [67]:
import numpy as nu   
import pandas as pd     
import matplotlib.pyplot as plt   
import seaborn as sns

In [68]:
orders = pd.read_csv(r'C:\Users\HP\Downloads\orders.csv')
products = pd.read_csv(r'C:\Users\HP\Downloads\products.csv')
customers = pd.read_csv(r'C:\Users\HP\Downloads\customers.csv')

In [69]:
orders.head(1)

   order_id  customer_id  product_id  order_date  amount
0     10001           39        1015  2023-08-15  497.49

In [70]:
products.head(1)

   product_id product_name     category   price
0        1001      Medical  Electronics  540.75

In [71]:
customers.head(1)

   customer_id      name                       email   join_date
0            1  Jennifer  buchanankimberly@james.biz  2023-03-31

In [72]:
step1 = orders.merge(customers, on='customer_id')
step2 = step1.merge(products, on='product_id')

In [73]:
step2.head(5)

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
0,10001,39,1015,2023-08-15,497.49,Kristen,jenniferpratt@hotmail.com,2022-04-21,Near,Stationery,754.46
1,10008,33,1015,2024-10-22,350.77,Jared,austin98@gmail.com,2023-12-10,Near,Stationery,754.46
2,10045,33,1015,2023-04-30,385.34,Jared,austin98@gmail.com,2023-12-10,Near,Stationery,754.46
3,10059,24,1015,2023-04-02,269.31,Christopher,barnesmichael@cole.com,2022-08-19,Near,Stationery,754.46
4,10096,18,1015,2025-06-10,440.83,Travis,mjordan@snow.biz,2021-04-18,Near,Stationery,754.46

In [74]:
step2.isnull().sum()

order_id        0
customer_id     0
product_id      0
order_date      0
amount          0
name            0
email           0
join_date       0
product_name    0
category        0
price           0
dtype: int64

In [75]:
#### 1.	How to list of All products, category and price.

In [76]:
one = step2[["product_name", "category", "price"]]

In [77]:
one.head(5)

  product_name    category   price
0         Near  Stationery  754.46
1         Near  Stationery  754.46
2         Near  Stationery  754.46
3         Near  Stationery  754.46
4         Near  Stationery  754.46

In [78]:
step2.head(1)

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
0,10001,39,1015,2023-08-15,497.49,Kristen,jenniferpratt@hotmail.com,2022-04-21,Near,Stationery,754.46

In [79]:
### 2.	How to find the top 2 old customers.

In [80]:
  
pd.to_datetime(step2["join_date"])  
oldest_customers = step2.sort_values(by="join_date").head(2)

In [81]:
oldest_customers

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
47,10019,30,1027,2024-04-22,316.66,Kelly,valerie91@hotmail.com,2020-07-22,Main,Stationery,920.95
11,10090,30,1037,2022-11-28,175.03,Kelly,valerie91@hotmail.com,2020-07-22,Dog,Stationery,51.40

In [82]:
### 3.	How to find the top 5 customers by total purchase amount.

In [83]:
step2.head(1)

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
0,10001,39,1015,2023-08-15,497.49,Kristen,jenniferpratt@hotmail.com,2022-04-21,Near,Stationery,754.46

In [84]:
step2.groupby('name')['amount'].sum().sort_values(ascending=False).head(5)

name
Kristen      1849.78
Ashlee       1420.57
Gina         1407.62
Jamie        1374.69
Stephanie    1361.19
Name: amount, dtype: float64

In [85]:
### 4.	How to identify products that have never been ordered.

In [86]:
step2.groupby('product_name')['order_id'].value_counts().sort_values(ascending=True)

product_name  order_id
Accept        10063       1
Science       10030       1
Resource      10011       1
              10041       1
              10043       1
                         ..
Discuss       10089       1
              10091       1
              10010       1
Ever          10005       1
Yard          10083       1
Name: count, Length: 100, dtype: int64

In [87]:
step2["order_id"].isna().sum()

0

In [88]:
step2[['order_id', 'product_name']]

    order_id product_name
0      10001         Near
1      10008         Near
2      10045         Near
3      10059         Near
4      10096         Near
..       ...          ...
95     10080         Site
96     10068        Sport
97     10070         East
98     10085          Our
99     10099      Require

[100 rows x 2 columns]

In [89]:
### 5.	How to identify products that have maximum ordered.

In [93]:
step2.head(4)

,order_id,customer_id,product_id,order_date,amount,name,email,join_date,product_name,category,price
0,10001,39,1015,2023-08-15,497.49,Kristen,jenniferpratt@hotmail.com,2022-04-21,Near,Stationery,754.46
1,10008,33,1015,2024-10-22,350.77,Jared,austin98@gmail.com,2023-12-10,Near,Stationery,754.46
2,10045,33,1015,2023-04-30,385.34,Jared,austin98@gmail.com,2023-12-10,Near,Stationery,754.46
3,10059,24,1015,2023-04-02,269.31,Christopher,barnesmichael@cole.com,2022-08-19,Near,Stationery,754.46

In [97]:
step2.groupby('order_id')['product_name'].sum().value_counts().head(5)

product_name
Black      6
Near       5
Central    5
Discuss    4
Region     4
Name: count, dtype: int64

## Done